import type { Qosidah } from '@/lib/types';

export const ahmadYaHabibi: Qosidah = {
  id: "0cb806a0-b48c-4751-8691-b581119e86b0",
  title: "Ahmad Ya Habibi",
  alternate_title: "Ahmad Ya Habibi Habibi",
  category_id: 'qosidah-arobiah',
  category_name: "Qosidah 'Arobiah",
  arabic_text: `أَحْمَدْ يَا حَبِيْبِيْ حَبِيْبِيْ
حَبِيْبِيْ سَلَامْ حَبِيْبِيْ
سَلَامْ عَلَيْكَ حَبِيْبِيْ
أَحْمَدْ يَا حَبِيْبِيْ حَبِيْبِيْ
حَبِيْبِيْ سَلَامْ حَبِيْبِيْ
سَلَامْ عَلَيْكَ حَبِيْبِيْ
يَا عَوْنَ الْغَرِيْبِ سَلَامْ عَلَيْكَ
أَمْنٌ وَسَلَامْ سَلَامْ عَلَيْكَ
يَا عَوْنَ الْغَرِيْبِ سَلَامْ عَلَيْكَ
أَمْنٌ وَسَلَامْ سَلَامْ عَلَيْكَ
دِيْنُكَ الْإِسْلَامْ سَلَامْ عَلَيْكَ
جِئْتَ بِالْقُرْآنْ سَلَامْ عَلَيْكَ
دِيْنُكَ الْإِسْلَامْ سَلَامْ عَلَيْكَ
جِئْتَ بِالْقُرْآنْ سَلَامْ عَلَيْكَ
أَحْمَدْ يَا حَبِيْبِيْ حَبِيْبِيْ
حَبِيْبِيْ سَلَامْ حَبِيْبِيْ
سَلَامْ عَلَيْكَ حَبِيْبِيْ
أَحْمَدْ يَا حَبِيْبِيْ حَبِيْبِيْ
حَبِيْبِيْ سَلَامْ حَبِيْبِيْ
سَلَامْ عَلَيْكَ حَبِيْبِيْ`,
  latin_text: "",
  translation: "",
  tags: ["Sholawat","Arobiah","Klasik"],
  notes: "Qosidah 'Arobiah Hadroh Khoirunnada.",
  is_active: true,
  sort_order: 18,
  created_at: '2026-10-10T00:00:00Z',
};
