import type { Qosidah } from '@/lib/types';

export const bimaulidilHadi: Qosidah = {
  id: "199d4b62-528f-452f-abbf-a12b75772a0e",
  title: "Bi Maulidil Hadi",
  alternate_title: "Bimaulidil Hadi",
  category_id: 'qosidah-arobiah',
  category_name: "Qosidah 'Arobiah",
  arabic_text: `بِمَوْلِدِ الْهَادِى * قَدْضَاءَتِ اْلاَكْوَانْ
بِمَوْلِدِ الْهَادِى * قَدْضَاءَتِ اْلاَكْوَانْ

يَابَهْجَـةَ الدُّنْيَـا * يَانَفْحَـةَ الرَّحْـمٰـنْ
يَابَهْجَـةَ الدُّنْيَـا * يَانَفْحَـةَ الرَّحْـمٰـنْ

يَامَبْعَثَ الرَّحْمَـةْ * يَاكَاشِفَ اْلغُمَّـةْ
يَامَبْعَثَ الرَّحْمَـةْ * يَاكَاشِفَ اْلغُمَّـةْ

تَـمَّتْ بِكَ النِّعْمَـةْ * يَامِـنَّـةَ الدَّيَّــانْ
تَـمَّتْ بِكَ النِّعْمَـةْ * يَامِـنَّـةَ الدَّيَّــانْ

يَاسَيِّدَ السَّادَاتْ * يَاصَاحِبَ الْـخَيْرَاتْ
يَاسَيِّدَ السَّادَاتْ * يَاصَاحِبَ الْـخَيْرَاتْ

قَـدْجِئْتَ بِالْاٰيَاتْ * يَا نُسْحَـةَ الفُرْقَـانْ
قَـدْجِئْتَ بِالْاٰيَاتْ * يَا نُسْحَـةَ الفُرْقَـانْ

بِمَوْلِدِ الْهَادِى * قَدْضَاءَتِ اْلاَكْوَانْ
بِمَوْلِدِ الْهَادِى * قَدْضَاءَتِ اْلاَكْوَانْ

يَابَهْجَـةَ الدُّنْيَـا * يَانَفْحَـةَ الرَّحْـمٰـنْ
يَابَهْجَـةَ الدُّنْيَـا * يَانَفْحَـةَ الرَّحْـمٰـنْ`,
  latin_text: "",
  translation: "",
  tags: ["Maulid","Arobiah","Gembira"],
  notes: "Qosidah 'Arobiah Hadroh Khoirunnada.",
  is_active: true,
  sort_order: 17,
  created_at: '2026-10-10T00:00:00Z',
};
